**There are two central concepts which you should know about**   
- *Series* - A series is esssentially a column
- *Data Frame* - its a 2D object. a dataframe is collection of series

In [4]:
import numpy as np
import pandas as pd

In [6]:
data = pd.Series([3,2,0,1], index=['a','b','c','d'])
data

a    3
b    2
c    0
d    1
dtype: int64

In [43]:
data.name='Apple'
data

a    3
b    2
c    0
d    1
Name: Apple, dtype: int64

In [45]:
data1 = pd.Series([0,3,7,2])
data1.name='Oranges'
data1

0    0
1    3
2    7
3    2
Name: Oranges, dtype: int64

In [47]:
import warnings
warnings.filterwarnings('ignore')

In [54]:
data2=np.random.randint(3,10,(4,5))
data2

array([[8, 4, 9, 6, 8],
       [3, 4, 3, 6, 3],
       [3, 6, 4, 4, 6],
       [3, 3, 5, 6, 3]])

In [58]:
d=pd.DataFrame(data2,columns=['a','b','c','d','e'], index=[1,2,3,4])
d

   a  b  c  d  e
1  8  4  9  6  8
2  3  4  3  6  3
3  3  6  4  4  6
4  3  3  5  6  3

In [62]:
data3=np.random.randint(4,6,(3,4))
f=pd.DataFrame(data3, index=['First','Second','Third'], columns=['A','B','C','D'])
f

        A  B  C  D
First   4  5  5  4
Second  5  4  4  4
Third   4  5  4  4

**Creating DataFrames using list of lists**

In [65]:
z=[['xyz',20],['abc',25],['asd',27]]
data = pd.DataFrame(z)
data

     0   1
0  xyz  20
1  abc  25
2  asd  27

In [67]:
data.columns=['Name','Age']
data

  Name  Age
0  xyz   20
1  abc   25
2  asd   27

**Creating DataFrames using Dictionaries**

In [72]:
z={'name':['xyz','abc','asd'],'age':[20,25,27]}
data=pd.DataFrame(z)
data

  name  age
0  xyz   20
1  abc   25
2  asd   27

**Creating a DataFrame using list of dictionary**

In [13]:
z=[{'Name':'xyz','Age':20},{'Name':'abc','Age':30},{'Name':'asd','Age':27}]
data=pd.DataFrame(z)
data

  Name  Age
0  xyz   20
1  abc   30
2  asd   27

**Creating a DataFrame using zip() function**

In [16]:
names=['abc','def','ghi']
ages=[11,12,13]
list_of_tuples=list(zip(names,ages))
list_of_tuples

[('abc', 11), ('def', 12), ('ghi', 13)]

In [18]:
data=pd.DataFrame(list_of_tuples)
data

     0   1
0  abc  11
1  def  12
2  ghi  13

In [24]:
data.columns=['Name','Age']
data.index=['i','j','k']
data

  Name  Age
i  abc   11
j  def   12
k  ghi   13